-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2026-07-23 15:38:10
-- 服务器版本： 5.7.43-log
-- PHP 版本： 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `luckypay`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin_permissions`
--

CREATE TABLE `admin_permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `http_method` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `http_path` text COLLATE utf8mb4_unicode_ci,
  `order` int(11) NOT NULL DEFAULT '0',
  `parent_id` bigint(20) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `admin_permissions`
--

INSERT INTO `admin_permissions` (`id`, `name`, `slug`, `http_method`, `http_path`, `order`, `parent_id`, `created_at`, `updated_at`) VALUES
(7, '数据报表', 'data-report', '', '', 7, 0, '2024-06-19 11:28:50', '2026-04-02 06:32:48'),
(8, '商户报表', 'dashborad-report-merchants', 'GET', '/report-merchants', 8, 7, '2024-06-19 11:29:51', '2026-04-02 06:32:48'),
(9, '币种报表', 'dashboard-report-currency', 'GET', '/report-currencys', 9, 7, '2024-06-19 11:30:39', '2026-04-02 06:32:48'),
(10, '渠道报表', 'dashborad-report-channel', 'GET', '/report-channels', 10, 7, '2024-06-19 11:31:22', '2026-04-02 06:32:48'),
(11, '金主报表', 'dashborad-report-users', 'GET', '/report-users', 11, 7, '2024-06-19 11:31:55', '2026-04-02 06:32:48'),
(12, '上号报表', 'dashboard-report-user-bank', 'GET', '/report-user-banks', 12, 7, '2024-06-19 11:32:29', '2026-04-02 06:32:48'),
(13, '商户管理', 'merchant-manager', '', '', 14, 0, '2024-06-19 11:33:00', '2026-04-02 06:32:48'),
(14, '商户信息', 'merchant-info', '', '/merchant/auth/users*', 15, 13, '2024-06-19 11:33:55', '2026-04-02 06:32:48'),
(15, '商户费率', 'merchant-payments', '', '/merchant-payments*', 23, 13, '2024-06-19 11:35:33', '2026-07-22 12:05:49'),
(16, '商户流水', 'merchant-balance-logs', '', '/merchant-balance-logs', 24, 13, '2024-06-19 11:36:13', '2026-04-02 06:32:48'),
(17, '代理功能', 'all-agent', '', '', 27, 0, '2024-06-19 11:39:50', '2026-04-02 06:32:48'),
(18, '商户代理', 'merchant-agent-auth-users', '', '/agent/auth/users*', 28, 17, '2024-06-19 11:41:16', '2026-04-02 06:32:48'),
(19, '商户代理费率', 'merchant-rates-agent-payments', 'GET', '/rates-agent-payments', 30, 17, '2024-06-19 11:41:57', '2026-04-02 06:32:48'),
(20, '商户代理流水', 'merchant-agent-balance-logs', 'GET', '/agent-balance-logs', 31, 17, '2024-06-19 11:43:01', '2026-07-22 12:42:45'),
(21, '商户代理报表', 'merchant-agent-reports', 'GET', '/report-merchant-agents', 32, 17, '2024-06-19 11:43:57', '2026-04-02 06:32:48'),
(22, '金主代理', 'user-agent1', '', '/agents*', 33, 17, '2024-06-19 11:45:23', '2026-04-02 06:32:48'),
(23, '金主代理费率', 'user-agent-rates', 'GET', '/user-agent-rates', 35, 17, '2024-06-19 11:46:04', '2026-04-02 06:32:48'),
(24, '金主代理流水', 'user-agent-balance-logs', 'GET', '/user-agent-balance-logs', 36, 17, '2024-06-19 11:53:24', '2026-07-22 12:44:25'),
(25, '金主代理报表', 'user-agent-reports', 'GET', '/report-user-agents', 37, 17, '2024-06-19 11:53:54', '2026-04-02 06:32:48'),
(26, '渠道管理', 'channel-manager', '', '', 38, 0, '2024-06-19 11:54:18', '2026-04-02 06:32:48'),
(27, '渠道列表', 'channels-index', '', '/channels*', 39, 26, '2024-06-19 11:56:05', '2026-07-22 12:50:33'),
(28, '渠道账号', 'channel-accounts', '', '/channel-accounts*', 40, 26, '2024-06-19 11:56:35', '2026-04-02 06:32:48'),
(29, '商户渠道', 'merchant-channels', '', '/merchant-channels*', 41, 26, '2024-06-19 11:56:59', '2026-04-02 06:32:48'),
(30, '金主管理', 'user-manager', '', '', 43, 0, '2024-06-19 12:05:55', '2026-04-02 06:32:48'),
(32, '金主列表', 'users-index', '', '/tusers*', 44, 30, '2024-06-19 12:07:07', '2026-04-02 06:32:48'),
(33, '金主收款卡', 'bank-users', '', '/bank-users*', 46, 30, '2024-06-19 12:07:46', '2026-04-02 06:32:48'),
(34, '订单管理', 'order-manager', '', '', 49, 0, '2024-06-19 12:08:10', '2026-04-02 06:32:48'),
(35, '商户充值订单', 'deposit-orders', 'GET', '/deposit-orders', 50, 34, '2024-06-19 12:08:50', '2026-04-02 06:32:48'),
(36, '商户代付订单', 'transfer-orders', 'GET', '/transfer-orders', 51, 34, '2024-06-19 12:09:20', '2026-04-02 06:32:48'),
(37, '商户冻结订单', 'freeze-orders', 'GET', '/freeze-orders', 52, 34, '2024-06-19 12:09:52', '2026-04-02 06:32:48'),
(38, '商户结算订单', 'settlement-orders', 'GET', '/settlement-orders', 53, 34, '2024-06-19 12:10:26', '2026-04-02 06:32:48'),
(39, '运维管理', 'system-manager', '', '', 54, 0, '2024-06-19 12:11:11', '2026-04-02 06:32:48'),
(40, '管理员', 'system-auth-users', '', '/auth/users*', 55, 39, '2024-06-19 12:11:56', '2026-04-02 06:32:48'),
(42, '银行代码', 'bank-codes', '', '/bank-codes*', 56, 39, '2024-06-19 12:13:30', '2026-04-02 06:32:48'),
(43, '自营管理', 'selfchannel-manager', '', '', 71, 0, '2024-06-19 12:14:06', '2026-04-02 06:32:48'),
(44, '自营配置', 'selfchannels.config', '', '/selfchannels/config', 72, 43, '2024-06-19 12:14:39', '2026-04-02 06:32:48'),
(45, '自营分组', 'group-users', '', '/group-users*', 73, 43, '2024-06-19 12:15:10', '2026-04-02 06:32:48'),
(46, '日志管理', 'log-manager', 'GET', '', 74, 0, '2024-06-19 12:15:29', '2026-04-02 06:32:48'),
(47, '总后台', 'admin_log-admin', 'GET', '', 75, 46, '2024-06-19 12:15:54', '2026-04-02 06:32:48'),
(48, '商户端', 'admin_log_merchant', 'GET', '', 79, 46, '2024-06-19 12:16:22', '2026-04-02 06:32:48'),
(49, '黑名单', 'black-contents', '', '/black-contents*', 57, 39, '2024-06-27 05:31:48', '2026-07-22 14:14:11'),
(53, 'ApiTest', 'apitest', 'GET', '/apiTest', 58, 39, '2024-07-12 04:04:09', '2026-04-02 06:32:48'),
(54, '角色管理', 'auth_roles', '', '/auth/roles*', 59, 39, '2024-07-15 15:11:34', '2026-04-02 06:32:48'),
(55, '通道编码', 'payment', 'GET', '/payment', 60, 39, '2024-07-21 16:56:59', '2026-04-02 06:32:48'),
(56, '删除商户', 'merchant-user-delete', '', '', 17, 14, '2024-08-05 10:34:45', '2026-07-22 11:51:41'),
(62, '飞机群发', 'telegramQunSend', 'GET', '/telegramQunSend', 61, 39, '2024-08-21 05:41:50', '2026-04-02 06:32:48'),
(63, '金主流水', 'user-balance-logs', 'GET', '/user-balance-logs', 48, 30, '2024-08-24 02:39:31', '2026-07-22 13:45:54'),
(64, '渠道成本', 'rates-channels', '', '/rates-channels*', 42, 26, '2024-11-05 14:06:38', '2026-04-02 06:32:48'),
(65, '通道报表', 'dashboard-report-payment', 'GET', '/report-payments', 13, 7, '2025-06-15 12:41:54', '2026-04-02 06:32:48'),
(66, '配置管理', 'config.manager', '', '', 62, 0, '2025-07-26 01:29:54', '2026-04-02 06:32:48'),
(67, '基础配置', 'config.base', 'GET', '/config/base', 63, 66, '2025-07-26 01:31:04', '2026-04-02 06:32:48'),
(68, '代收配置', 'config.deposit', 'GET', '/config/deposit', 64, 66, '2025-07-26 01:32:38', '2026-04-02 06:32:48'),
(69, '代付配置', 'config.transfer', 'GET', '/config/transfer', 65, 66, '2025-07-26 01:33:28', '2026-04-02 06:32:48'),
(70, '飞机配置', 'config.telegram', 'GET', '/config/telegram', 66, 66, '2025-07-26 01:35:22', '2026-04-02 06:32:48'),
(71, '通知配置', 'config.notice', 'GET', '/config/notice', 67, 66, '2025-07-26 01:36:37', '2026-04-02 06:32:48'),
(72, '商户配置', 'config.merchant', 'GET', '/config/merchant', 68, 66, '2025-07-26 01:37:34', '2026-04-02 06:32:48'),
(73, '风控配置', 'config.risk', 'GET', '/config/risk', 69, 66, '2025-07-26 23:07:25', '2026-04-02 06:32:48'),
(74, '新增商户', 'merchant-user-add', '', '', 16, 14, '2025-07-30 05:33:18', '2026-07-22 11:51:41'),
(75, '编辑商户', 'merchant-user-edit', '', '', 18, 14, '2025-07-30 05:34:04', '2026-07-22 11:51:41'),
(76, '重置密码', 'merchant-user-reset-password', '', '', 19, 14, '2025-07-30 07:08:24', '2026-07-22 11:51:41'),
(77, '重置谷歌验证码', 'merchant-user-reset-googlecode', '', '', 20, 14, '2025-07-30 07:08:57', '2026-07-22 11:51:41'),
(78, '解绑机器人', 'merchant-user-unbind-telegram', '', '', 21, 14, '2025-07-30 07:26:19', '2026-07-22 11:51:41'),
(80, '白名单设置', 'merchant-user-white-ip', '', '', 22, 14, '2025-07-30 07:38:09', '2026-07-22 11:51:41'),
(81, '今日统计', 'today-report', '', '', 1, 0, '2025-09-04 04:23:52', '2025-09-04 04:23:59'),
(82, '商户监控', 'today-index', 'GET', '/today/index', 2, 81, '2025-09-04 04:25:15', '2026-04-02 06:32:48'),
(83, '商户成效', 'today-merchantBenefit', 'GET', '/today/merchantBenefit', 3, 81, '2025-09-04 04:26:12', '2026-04-02 06:32:48'),
(84, '渠道成效', 'today-channelBenefit', 'GET', '/today/channelBenefit', 4, 81, '2025-09-04 04:26:49', '2026-04-02 06:32:48'),
(85, '金主成效', 'today-userBenefit', 'GET', '/today/userBenefit', 5, 81, '2025-09-04 04:27:19', '2026-04-02 06:32:48'),
(86, '上号成效', 'today-bankBenefit', 'GET', '/today/bankBenefit', 6, 81, '2025-09-04 04:27:52', '2026-04-02 06:32:48'),
(87, '欧易配置', 'config.okx', 'GET', '/config/okx', 70, 66, '2026-02-03 04:50:47', '2026-04-02 06:32:48'),
(88, '操作日志', 'admin_log_other', 'GET', '/admin-operation-logs', 76, 47, '2026-02-14 00:58:37', '2026-04-02 06:32:48'),
(89, '登录日志', 'admin_log_login', 'GET', '/admin-login-logs', 77, 47, '2026-02-14 00:59:55', '2026-04-02 06:32:48'),
(90, '操作日志', 'admin_log_merchant_other', 'GET', '/merchant-operation-logs', 80, 48, '2026-02-14 01:01:35', '2026-04-02 06:32:48'),
(91, '登录日志', 'admin_log_merchant_login', 'GET', '/merchant-login-logs', 81, 48, '2026-02-14 01:02:05', '2026-04-02 06:32:48'),
(92, '商户代理', 'admin_log_agent', 'GET', '', 82, 46, '2026-02-14 01:02:58', '2026-04-02 06:32:48'),
(93, '操作日志', 'admin_log_merchant_agent_other', 'GET', '/agent-operation-logs', 83, 92, '2026-02-14 01:03:35', '2026-04-02 06:32:48'),
(94, '登录日志', 'admin_log_merchant_agent_login', 'GET', '/agent-login-logs', 84, 92, '2026-02-14 01:04:23', '2026-04-02 06:32:48'),
(95, '金主(代理)', 'admin_log_user', 'GET', '', 85, 46, '2026-02-14 01:04:50', '2026-04-02 06:32:48'),
(96, '操作日志', 'admin_log_user_other', 'GET', '/user-operation-logs', 86, 95, '2026-02-14 01:05:27', '2026-04-02 06:32:48'),
(97, '登录日志', 'admin_log_user_login', 'GET', '/user-login-logs', 87, 95, '2026-02-14 01:05:54', '2026-04-02 06:32:48'),
(98, '商户日切', 'day-balance-logs', 'GET', '/day-balance-logs', 26, 13, '2026-03-20 08:23:52', '2026-04-02 06:32:48'),
(99, '登陆异常', 'ip-blacklists', '', '/ip-blacklists', 78, 47, '2026-03-26 05:31:20', '2026-04-02 06:32:48'),
(100, '自营面板', 'selfchannels-index', 'GET', '/selfchannels/index', 88, 43, '2026-04-29 04:15:35', '2026-04-29 04:15:35'),
(101, 'API代收测试', 'admin_operation_manager_api_deposit_test', 'GET', '/api/deoisit/test', 89, 53, '2026-05-02 02:43:01', '2026-05-02 02:43:01'),
(102, 'API代付测试', 'admin_operation_manager_api_transfer_test', 'GET', '/api/transfer/test', 90, 53, '2026-05-02 02:43:35', '2026-05-02 02:43:35'),
(103, '安全配置', 'config-security', 'GET', '/config/security', 91, 66, '2026-05-03 02:29:47', '2026-05-03 02:30:42'),
(104, '金主日切', 'user-day-balance-logs', 'GET', '/user-day-balance-logs', 92, 30, '2026-07-19 07:55:27', '2026-07-19 07:55:56'),
(105, '日总报表', 'report-days', 'GET', '/report-days', 93, 7, '2026-07-19 13:37:30', '2026-07-19 13:38:21'),
(108, '解锁商户登录', 'merchant-user-unlock-login', '', '', 94, 14, '2026-07-22 11:54:10', '2026-07-22 11:54:10'),
(109, '删除商户群管理员', 'merchant-user-delete-telegram-admin', '', '', 95, 14, '2026-07-22 11:54:10', '2026-07-22 11:54:10'),
(110, '新增商户费率', 'merchant-payment-create', '', '', 96, 15, '2026-07-22 12:04:18', '2026-07-22 12:04:18'),
(111, '编辑商户费率', 'merchant-payment-edit', '', '', 97, 15, '2026-07-22 12:04:18', '2026-07-22 12:04:18'),
(112, '删除商户费率', 'merchant-payment-delete', '', '', 98, 15, '2026-07-22 12:04:18', '2026-07-22 12:04:18'),
(113, '启用/禁用商户费率', 'merchant-payment-status', '', '', 99, 15, '2026-07-22 12:04:18', '2026-07-22 12:04:18'),
(114, '批量设置商户费率限额', 'merchant-payment-batch-limit', '', '', 100, 15, '2026-07-22 12:04:18', '2026-07-22 12:04:18'),
(115, '批量设置商户费率', 'merchant-payment-batch-rate', '', '', 101, 15, '2026-07-22 12:04:18', '2026-07-22 12:04:18'),
(116, '商户资金加项', 'merchant-balance-log-add', '', '', 102, 16, '2026-07-22 12:11:48', '2026-07-22 12:11:48'),
(117, '商户资金减项', 'merchant-balance-log-reduce', '', '', 103, 16, '2026-07-22 12:11:48', '2026-07-22 12:11:48'),
(118, '商户流水冲正', 'merchant-balance-log-corre', '', '', 104, 16, '2026-07-22 12:11:48', '2026-07-22 12:11:48'),
(119, '新增商户代理', 'merchant-agent-create', '', '', 105, 18, '2026-07-22 12:19:23', '2026-07-22 12:19:23'),
(120, '编辑商户代理', 'merchant-agent-edit', '', '', 106, 18, '2026-07-22 12:19:23', '2026-07-22 12:19:23'),
(121, '删除商户代理', 'merchant-agent-delete', '', '', 107, 18, '2026-07-22 12:19:23', '2026-07-22 12:19:23'),
(122, '重置商户代理 Google 验证', 'merchant-agent-reset-googlecode', '', '', 108, 18, '2026-07-22 12:19:23', '2026-07-22 12:19:23'),
(123, '解锁商户代理登录', 'merchant-agent-unlock-login', '', '', 109, 18, '2026-07-22 12:19:23', '2026-07-22 12:19:23'),
(124, '商户代理资金加项', 'merchant-agent-balance-log-add', '', '', 110, 20, '2026-07-22 12:24:30', '2026-07-22 12:24:30'),
(125, '商户代理资金减项', 'merchant-agent-balance-log-reduce', '', '', 111, 20, '2026-07-22 12:24:30', '2026-07-22 12:24:30'),
(126, '商户代理流水冲正', 'merchant-agent-balance-log-corre', '', '', 112, 20, '2026-07-22 12:24:30', '2026-07-22 12:24:30'),
(127, '新增金主代理', 'user-agent-create', '', '', 113, 22, '2026-07-22 12:28:47', '2026-07-22 12:28:47'),
(128, '编辑金主代理', 'user-agent-edit', '', '', 114, 22, '2026-07-22 12:28:47', '2026-07-22 12:28:47'),
(129, '删除金主代理', 'user-agent-delete', '', '', 115, 22, '2026-07-22 12:28:47', '2026-07-22 12:28:47'),
(130, '重置金主代理 Google 验证', 'user-agent-reset-googlecode', '', '', 116, 22, '2026-07-22 12:28:47', '2026-07-22 12:28:47'),
(131, '解锁金主代理登录', 'user-agent-unlock-login', '', '', 117, 22, '2026-07-22 12:28:47', '2026-07-22 12:28:47'),
(132, '强制金主代理退出', 'user-agent-force-logout', '', '', 118, 22, '2026-07-22 12:28:47', '2026-07-22 12:28:47'),
(133, '金主代理资金加项', 'user-agent-balance-log-add', '', '', 1, 24, '2026-07-22 12:43:54', '2026-07-22 12:43:54'),
(134, '金主代理资金减项', 'user-agent-balance-log-reduce', '', '', 2, 24, '2026-07-22 12:43:54', '2026-07-22 12:43:54'),
(135, '金主代理流水冲正', 'user-agent-balance-log-corre', '', '', 3, 24, '2026-07-22 12:43:54', '2026-07-22 12:43:54'),
(136, '新增渠道', 'channel-create', '', '', 1, 27, '2026-07-22 12:49:46', '2026-07-22 12:49:46'),
(137, '编辑渠道', 'channel-edit', '', '', 2, 27, '2026-07-22 12:49:46', '2026-07-22 12:49:46'),
(138, '删除渠道', 'channel-delete', '', '', 3, 27, '2026-07-22 12:49:46', '2026-07-22 12:49:46'),
(139, '解绑机器人', 'channel-reset-telegram', '', '', 4, 27, '2026-07-22 12:49:46', '2026-07-22 12:49:46'),
(140, '新增渠道账号', 'channel-account-create', '', '', 1, 28, '2026-07-22 12:52:47', '2026-07-22 12:52:47'),
(141, '编辑渠道账号', 'channel-account-edit', '', '', 2, 28, '2026-07-22 12:52:47', '2026-07-22 12:52:47'),
(142, '删除渠道账号', 'channel-account-delete', '', '', 3, 28, '2026-07-22 12:52:47', '2026-07-22 12:52:47'),
(143, '新增商户渠道', 'merchant-channel-create', '', '', 1, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(144, '编辑商户渠道', 'merchant-channel-edit', '', '', 2, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(145, '删除商户渠道', 'merchant-channel-delete', '', '', 3, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(146, '恢复商户渠道', 'merchant-channel-restore', '', '', 4, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(147, '批量添加商户渠道', 'merchant-channel-batch-add', '', '', 5, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(148, '批量设置代收限额', 'merchant-channel-batch-pay-limit', '', '', 6, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(149, '批量设置代付限额', 'merchant-channel-batch-collection-limit', '', '', 7, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(150, '批量设置商户渠道费率', 'merchant-channel-batch-rate', '', '', 8, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(151, '启用/禁用商户渠道', 'merchant-channel-status', '', '', 9, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(152, '启用/禁用商户渠道浮动', 'merchant-channel-float-status', '', '', 10, 29, '2026-07-22 12:57:00', '2026-07-22 12:57:00'),
(153, '新增渠道成本', 'channel-rate-create', '', '', 1, 64, '2026-07-22 13:01:31', '2026-07-22 13:01:31'),
(154, '编辑渠道成本', 'channel-rate-edit', '', '', 2, 64, '2026-07-22 13:01:31', '2026-07-22 13:01:31'),
(155, '删除渠道成本', 'channel-rate-delete', '', '', 3, 64, '2026-07-22 13:01:31', '2026-07-22 13:01:31'),
(156, '编辑金主', 'user-edit', '', '', 1, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(157, '启用/禁用金主账号', 'user-status', '', '', 2, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(158, '启用/禁用金主收单', 'user-acquisition-status', '', '', 3, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(159, '解锁金主登录', 'user-unlock-login', '', '', 4, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(160, '强制金主退出', 'user-force-logout', '', '', 5, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(161, '重置金主密码', 'user-reset-password', '', '', 6, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(162, '修改金主代理', 'user-update-agent', '', '', 7, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(163, '清除金主缓存', 'user-clear-cache', '', '', 8, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(164, '保证金加项', 'user-deposit-balance-add', '', '', 9, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(165, '保证金减项', 'user-deposit-balance-reduce', '', '', 10, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(166, '代收账户加项', 'user-collection-balance-add', '', '', 11, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(167, '代收账户减项', 'user-collection-balance-reduce', '', '', 12, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(168, '代付账户加项', 'user-transfer-balance-add', '', '', 13, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(169, '代付账户减项', 'user-transfer-balance-reduce', '', '', 14, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(170, '佣金账户加项', 'user-commission-balance-add', '', '', 15, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(171, '佣金账户减项', 'user-commission-balance-reduce', '', '', 16, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(172, '解绑金主机器人', 'user-unbind-telegram', '', '', 17, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(173, '重置金主 Google 验证', 'user-reset-googlecode', '', '', 18, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(174, '删除金主', 'user-delete', '', '', 19, 32, '2026-07-22 13:08:38', '2026-07-22 13:08:38'),
(175, '新增金主收款卡', 'user-bank-create', '', '', 1, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(176, '编辑金主收款卡', 'user-bank-edit', '', '', 2, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(177, '删除金主收款卡', 'user-bank-delete', '', '', 3, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(178, '还原金主收款卡', 'user-bank-restore', '', '', 4, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(179, '启用/禁用金主收款卡', 'user-bank-status', '', '', 5, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(180, '复制金主收款卡', 'user-bank-copy', '', '', 6, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(181, '批量复制金主收款卡', 'user-bank-batch-copy', '', '', 7, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(182, '批量开启金主收款卡', 'user-bank-batch-open', '', '', 8, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(183, '批量关闭金主收款卡', 'user-bank-batch-close', '', '', 9, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(184, '批量修改金主收款卡限额', 'user-bank-batch-limit', '', '', 10, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(185, '收款卡金额加项', 'user-bank-balance-add', '', '', 11, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(186, '收款卡金额减项', 'user-bank-balance-reduce', '', '', 12, 33, '2026-07-22 13:32:41', '2026-07-22 13:32:41'),
(187, '批量回调代收订单', 'deposit-order-batch-callback', '', '', 1, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(188, '更新代收订单缓存', 'deposit-order-update-cache', '', '', 2, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(189, '人工补单', 'deposit-order-manual-success', '', '', 3, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(190, '手动失败代收订单', 'deposit-order-manual-fail', '', '', 4, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(191, '手动超时代收订单', 'deposit-order-manual-timeout', '', '', 5, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(192, '冻结代收订单', 'deposit-order-freeze', '', '', 6, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(193, '推送代收订单回调', 'deposit-order-callback', '', '', 7, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(194, '手动查询代收订单状态', 'deposit-order-query-status', '', '', 8, 35, '2026-07-22 13:44:47', '2026-07-22 13:44:47'),
(195, '金主流水冲正', 'user-balance-log-corre', '', '', 1, 63, '2026-07-22 13:47:07', '2026-07-22 13:47:07'),
(196, '批量回调代付订单', 'transfer-order-batch-callback', '', '', 1, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(197, '批量提交代付订单', 'transfer-order-batch-submit', '', '', 2, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(198, '批量失败代付订单', 'transfer-order-batch-fail', '', '', 3, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(200, '手动成功代付订单', 'transfer-order-manual-success', '', '', 5, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(201, '手动失败代付订单', 'transfer-order-manual-fail', '', '', 6, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(202, '代付订单冲正', 'transfer-order-corre', '', '', 7, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(203, '设置/重新提交代付渠道', 'transfer-order-channel', '', '', 8, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(204, '推送代付订单回调', 'transfer-order-callback', '', '', 9, 36, '2026-07-22 13:51:57', '2026-07-22 13:51:57'),
(206, '解冻冻结订单', 'freeze-order-unfreeze', '', '', 1, 37, '2026-07-22 13:59:37', '2026-07-22 13:59:37'),
(207, '认领结算订单', 'settlement-order-claim', '', '', 1, 38, '2026-07-22 14:04:53', '2026-07-22 14:04:53'),
(208, '设置/重新提交结算渠道', 'settlement-order-channel', '', '', 2, 38, '2026-07-22 14:04:53', '2026-07-22 14:04:53'),
(209, '手动成功结算订单', 'settlement-order-manual-success', '', '', 3, 38, '2026-07-22 14:04:53', '2026-07-22 14:04:53'),
(210, '手动失败结算订单', 'settlement-order-manual-fail', '', '', 4, 38, '2026-07-22 14:04:53', '2026-07-22 14:04:53'),
(211, '结算订单冲正', 'settlement-order-corre', '', '', 5, 38, '2026-07-22 14:04:53', '2026-07-22 14:04:53'),
(212, '新增管理员', 'admin-user-create', '', '', 1, 40, '2026-07-22 14:07:51', '2026-07-22 14:07:51'),
(213, '编辑管理员', 'admin-user-edit', '', '', 2, 40, '2026-07-22 14:07:51', '2026-07-22 14:07:51'),
(214, '删除管理员', 'admin-user-delete', '', '', 3, 40, '2026-07-22 14:07:51', '2026-07-22 14:07:51'),
(215, '重置管理员 Google 验证', 'admin-user-reset-googlecode', '', '', 4, 40, '2026-07-22 14:07:51', '2026-07-22 14:07:51'),
(217, '设置管理员飞机权限', 'admin-user-telegram-role', '', '', 6, 40, '2026-07-22 14:07:51', '2026-07-22 14:07:51'),
(218, '新增银行代码', 'bank-code-create', '', '', 1, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(219, '编辑银行代码', 'bank-code-edit', '', '', 2, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(220, '删除银行代码', 'bank-code-delete', '', '', 3, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(221, '新增渠道银行代码', 'bank-code-channel-create', '', '', 4, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(222, '编辑渠道银行代码', 'bank-code-channel-edit', '', '', 5, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(223, '删除渠道银行代码', 'bank-code-channel-delete', '', '', 6, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(224, '复制渠道银行代码', 'bank-code-channel-copy', '', '', 7, 42, '2026-07-22 14:11:06', '2026-07-22 14:11:06'),
(225, '新增黑名单', 'black-content-create', '', '', 1, 49, '2026-07-22 14:14:11', '2026-07-22 14:14:11'),
(226, '编辑黑名单', 'black-content-edit', '', '', 2, 49, '2026-07-22 14:14:11', '2026-07-22 14:14:11'),
(227, '启用/禁用黑名单', 'black-content-status', '', '', 3, 49, '2026-07-22 14:14:11', '2026-07-22 14:14:11'),
(228, '删除黑名单', 'black-content-delete', '', '', 4, 49, '2026-07-22 14:14:11', '2026-07-22 14:14:11'),
(229, '解封 IP 黑名单', 'ip-blacklist-unban', '', '', 1, 99, '2026-07-22 14:14:11', '2026-07-22 14:14:11'),
(230, '新增自营分组', 'user-group-create', '', '', 1, 45, '2026-07-22 14:16:48', '2026-07-22 14:16:48'),
(231, '编辑自营分组', 'user-group-edit', '', '', 2, 45, '2026-07-22 14:16:48', '2026-07-22 14:16:48'),
(232, '删除自营分组', 'user-group-delete', '', '', 3, 45, '2026-07-22 14:16:48', '2026-07-22 14:16:48'),
(233, '启用/禁用自营分组', 'user-group-status', '', '', 4, 45, '2026-07-22 14:16:48', '2026-07-22 14:16:48'),
(234, '修改自营分组优先级', 'user-group-priority', '', '', 5, 45, '2026-07-22 14:16:48', '2026-07-22 14:16:48');

--
-- 转储表的索引
--

--
-- 表的索引 `admin_permissions`
--
ALTER TABLE `admin_permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `admin_permissions_slug_unique` (`slug`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `admin_permissions`
--
ALTER TABLE `admin_permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=235;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
